In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':list('XXYYZ'), 
                    'k2':['alpha','beta','alpha','beta','alpha'], 
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha
1 -0.979068 -0.554082  X   beta
2  0.514818  0.468504  Y  alpha
3 -1.603827  0.579287  Y   beta
4  0.548729 -0.605737  Z  alpha

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [5]:
group1.mean()

k1
X    -0.738441
Y    -0.544505
Z     0.548729
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.979068
    JAN    0.514818
NY  FEB   -1.603827
    JAN    0.025458
Name: dataset1, dtype: float64

In [9]:
dframe

   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha
1 -0.979068 -0.554082  X   beta
2  0.514818  0.468504  Y  alpha
3 -1.603827  0.579287  Y   beta
4  0.548729 -0.605737  Z  alpha

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.738441 -0.876147
Y  -0.544505  0.523895
Z   0.548729 -0.605737

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.497813 -1.198212
   beta  -0.979068 -0.554082
Y  alpha  0.514818  0.468504
   beta  -1.603827  0.579287
Z  alpha  0.548729 -0.605737

In [13]:
dframe.groupby(['k1']).size()

k1
X     2
Y     2
Z     1
dtype: int64

In [14]:
dframe

   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha
1 -0.979068 -0.554082  X   beta
2  0.514818  0.468504  Y  alpha
3 -1.603827  0.579287  Y   beta
4  0.548729 -0.605737  Z  alpha

In [15]:
for name,group in dframe.groupby('k1'):
    print 'This is the %s group' %name
    print group
    print '\n'

This is the X group
   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha
1 -0.979068 -0.554082  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.514818  0.468504  Y  alpha
3 -1.603827  0.579287  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.548729 -0.605737  Z  alpha

In [16]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print 'Key1 = %s Key2 %s' %(k1,k2)
    print group
    print '\n'

Key1 = X Key2 alpha
   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha


Key1 = X Key2 beta
   dataset1  dataset2 k1    k2
1 -0.979068 -0.554082  X  beta


Key1 = Y Key2 alpha
   dataset1  dataset2 k1     k2
2  0.514818  0.468504  Y  alpha


Key1 = Y Key2 beta
   dataset1  dataset2 k1    k2
3 -1.603827  0.579287  Y  beta


Key1 = Z Key2 alpha
   dataset1  dataset2 k1     k2
4  0.548729 -0.605737  Z  alpha

In [17]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict

{'X':    dataset1  dataset2 k1     k2
 0 -0.497813 -1.198212  X  alpha
 1 -0.979068 -0.554082  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2  0.514818  0.468504  Y  alpha
 3 -1.603827  0.579287  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4  0.548729 -0.605737  Z  alpha}

In [18]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha
1 -0.979068 -0.554082  X   beta

In [19]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.497813 -1.198212
 1 -0.979068 -0.554082
 2  0.514818  0.468504
 3 -1.603827  0.579287
 4  0.548729 -0.605737, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [21]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.198212
   beta  -0.554082
Y  alpha  0.468504
   beta   0.579287
Z  alpha -0.605737

In [22]:
dframe

   dataset1  dataset2 k1     k2
0 -0.497813 -1.198212  X  alpha
1 -0.979068 -0.554082  X   beta
2  0.514818  0.468504  Y  alpha
3 -1.603827  0.579287  Y   beta
4  0.548729 -0.605737  Z  alpha